In [1]:
import pandas as pd

### Create a python dictionary with list values and convert to a pandas dataframe

In [2]:
data = {"oranges" : [2,8,0,6,7], "apple" : [3,8,2,0,6], "banana" : [5,6,1,3,0]}

In [3]:
data

{'oranges': [2, 8, 0, 6, 7],
 'apple': [3, 8, 2, 0, 6],
 'banana': [5, 6, 1, 3, 0]}

### Create the data frame with my own custom indices

In [6]:
df1 = pd.DataFrame(data, index=["a",'b','c','John',"Moha"])

In [7]:
df1

      oranges  apple  banana
a           2      3       5
b           8      8       6
c           0      2       1
John        6      0       3
Moha        7      6       0

In [8]:
type(df1)

pandas.core.frame.DataFrame

### Different ways to access a DataFrame object column

In [17]:
a1 = df1['apple']

In [18]:
type(a1)

pandas.core.series.Series

In [19]:
a2 = df1.apple

In [20]:
type(a2)

pandas.core.series.Series

### Explore inbuilt methods in both Dataframe and Series

In [24]:
c = df1.columns

In [25]:
type(c)

pandas.core.indexes.base.Index

In [29]:
cl = list(c)

In [30]:
type(cl)

list

In [31]:
cl

['oranges', 'apple', 'banana']

### Change the column named 'apple' to 'lemon'

In [34]:
df2 = df1.rename({'apple':'lemon'}, axis='columns')

In [35]:
df2

      oranges  lemon  banana
a           2      3       5
b           8      8       6
c           0      2       1
John        6      0       3
Moha        7      6       0

### Using Inplace arguement in a method in a Dataframe/Series it replaces the original memory storage location for the dataframe i.e it replaces the previous dataframe

In [41]:
df1.rename({'apple':'lemon'}, axis='columns', inplace=True)

In [43]:
o = df1['oranges']

In [45]:
type(o)

pandas.core.series.Series

In [46]:
o.Moha

7

### Get Moha row for the columns oranges and banana

_We use the loc method to get a row index_

In [58]:
m = df1.loc['Moha',['lemon','banana']]

In [60]:
type(m)

pandas.core.series.Series

In [53]:
m

oranges    7
lemon      6
banana     0
Name: Moha, dtype: int64

In [61]:
df2

      oranges  lemon  banana
a           2      3       5
b           8      8       6
c           0      2       1
John        6      0       3
Moha        7      6       0

### Accessing row a and 2 columns

In [85]:
df2.loc['a',['oranges','banana']]

oranges    2
banana     5
Name: a, dtype: int64

### Access row a,b and c | Columns oranges and bananas

In [89]:
df2.loc[['a','b','c'],['oranges','banana']]

   oranges  banana
a        2       5
b        8       6
c        0       1

In [72]:
o = df2['oranges']

In [73]:
type(o)

pandas.core.series.Series

In [77]:
ol = df2[['oranges','lemon']]

In [78]:
type(ol)

pandas.core.frame.DataFrame

In [79]:
od = df2[['oranges']]

In [80]:
type(od)

pandas.core.frame.DataFrame